Revit 2027 API
FabricationRodInfo.SetRodEndPosition Method
 Sets the position of the rod end. The method is applicable only for bearer hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRodEndPosition(
	int rodIndex,
	XYZ position
)
Public Sub SetRodEndPosition (
	rodIndex As Integer,
	position As XYZ
)
public:
void SetRodEndPosition(
	int rodIndex,
	XYZ^ position
)
member SetRodEndPosition :
        rodIndex : int *
        position : XYZ -> unit
Parameters
rodIndex Int32
 The index of the rod.
position XYZ
 The position of the rod end.
Exceptions
Exception | Condition
ArgumentException |  Invalid rod position.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
InvalidOperationException |  The hanger is not a bearer hanger.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace